tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble_5_x_rw/ble_lib/ip/sch/import/ble_reg_em_et.h
__INLINE void em_bt_extab_status_setf(int elt_idx, uint8_t status)
{
    BLE_ASSERT_ERR((((uint16_t)status << 3) & ~((uint16_t)0x00000038)) == 0);
    EM_WR(EM_BT_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_BT_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00000038)) | ((uint16_t)status << 3));
}

__INLINE uint8_t em_bt_extab_mode_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_BT_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x00000007)) >> 0);
}

__INLINE void em_bt_extab_mode_setf(int elt_idx, uint8_t mode)
{
    BLE_ASSERT_ERR((((uint16_t)mode << 0) & ~((uint16_t)0x00000007)) == 0);
    EM_WR(EM_BT_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_BT_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00000007)) | ((uint16_t)mode << 0));
}

/**
 * @brief LE_EXTAB register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:11            SCH_PRIO1   0x0
 *     10                  SPA   0
 *     08               AE_NPS   0
 *     07                 RSVD   0
 *     06                  ISO   0
 *  05:03               STATUS   0x0
 *  02:00                 MODE   0x0
 * </pre>
 */
#define EM_LE_EXTAB_ADDR   (0x00910000 + EM_ET_OFFSET)
#define EM_LE_EXTAB_INDEX  0x00000000
#define EM_LE_EXTAB_RESET  0x00000000

__INLINE uint16_t em_le_extab_get(int elt_idx)
{
    return EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE);
}

__INLINE void em_le_extab_set(int elt_idx, uint16_t value)
{
    EM_WR(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE, value);
}

// field definitions
#define EM_SCH_PRIO1_MASK   ((uint16_t)0x0000F800)
#define EM_SCH_PRIO1_LSB    11
#define EM_SCH_PRIO1_WIDTH  ((uint16_t)0x00000005)
#define EM_SPA_BIT          ((uint16_t)0x00000400)
#define EM_SPA_POS          10
#define EM_AE_NPS_BIT       ((uint16_t)0x00000100)
#define EM_AE_NPS_POS       8
#define EM_RSVD_BIT         ((uint16_t)0x00000080)
#define EM_RSVD_POS         7
#define EM_ISO_BIT          ((uint16_t)0x00000040)
#define EM_ISO_POS          6
#define EM_STATUS_MASK      ((uint16_t)0x00000038)
#define EM_STATUS_LSB       3
#define EM_STATUS_WIDTH     ((uint16_t)0x00000003)
#define EM_MODE_MASK        ((uint16_t)0x00000007)
#define EM_MODE_LSB         0
#define EM_MODE_WIDTH       ((uint16_t)0x00000003)

#define EM_SCH_PRIO1_RST    0x0
#define EM_SPA_RST          0x0
#define EM_AE_NPS_RST       0x0
#define EM_RSVD_RST         0x0
#define EM_ISO_RST          0x0
#define EM_STATUS_RST       0x0
#define EM_MODE_RST         0x0

__INLINE void em_le_extab_pack(int elt_idx, uint8_t schprio1, uint8_t spa, uint8_t aenps, uint8_t rsvd, uint8_t iso, uint8_t status, uint8_t mode)
{
    BLE_ASSERT_ERR((((uint16_t)schprio1 << 11) & ~((uint16_t)0x0000F800)) == 0);
    BLE_ASSERT_ERR((((uint16_t)spa << 10) & ~((uint16_t)0x00000400)) == 0);
    BLE_ASSERT_ERR((((uint16_t)aenps << 8) & ~((uint16_t)0x00000100)) == 0);
    BLE_ASSERT_ERR((((uint16_t)rsvd << 7) & ~((uint16_t)0x00000080)) == 0);
    BLE_ASSERT_ERR((((uint16_t)iso << 6) & ~((uint16_t)0x00000040)) == 0);
    BLE_ASSERT_ERR((((uint16_t)status << 3) & ~((uint16_t)0x00000038)) == 0);
    BLE_ASSERT_ERR((((uint16_t)mode << 0) & ~((uint16_t)0x00000007)) == 0);
    EM_WR(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE,  ((uint16_t)schprio1 << 11) | ((uint16_t)spa << 10) | ((uint16_t)aenps << 8) | ((uint16_t)rsvd << 7) | ((uint16_t)iso << 6) | ((uint16_t)status << 3) | ((uint16_t)mode << 0));
}

__INLINE void em_le_extab_unpack(int elt_idx, uint8_t* schprio1, uint8_t* spa, uint8_t* aenps, uint8_t* rsvd, uint8_t* iso, uint8_t* status, uint8_t* mode)
{
    uint16_t localVal = EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE);

    *schprio1 = (localVal & ((uint16_t)0x0000F800)) >> 11;
    *spa = (localVal & ((uint16_t)0x00000400)) >> 10;
    *aenps = (localVal & ((uint16_t)0x00000100)) >> 8;
    *rsvd = (localVal & ((uint16_t)0x00000080)) >> 7;
    *iso = (localVal & ((uint16_t)0x00000040)) >> 6;
    *status = (localVal & ((uint16_t)0x00000038)) >> 3;
    *mode = (localVal & ((uint16_t)0x00000007)) >> 0;
}

__INLINE uint8_t em_le_extab_sch_prio1_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x0000F800)) >> 11);
}

__INLINE void em_le_extab_sch_prio1_setf(int elt_idx, uint8_t schprio1)
{
    BLE_ASSERT_ERR((((uint16_t)schprio1 << 11) & ~((uint16_t)0x0000F800)) == 0);
    EM_WR(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x0000F800)) | ((uint16_t)schprio1 << 11));
}

__INLINE uint8_t em_le_extab_spa_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x00000400)) >> 10);
}

__INLINE void em_le_extab_spa_setf(int elt_idx, uint8_t spa)
{
    BLE_ASSERT_ERR((((uint16_t)spa << 10) & ~((uint16_t)0x00000400)) == 0);
    EM_WR(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00000400)) | ((uint16_t)spa << 10));
}

__INLINE uint8_t em_le_extab_ae_nps_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x00000100)) >> 8);
}

__INLINE void em_le_extab_ae_nps_setf(int elt_idx, uint8_t aenps)
{
    BLE_ASSERT_ERR((((uint16_t)aenps << 8) & ~((uint16_t)0x00000100)) == 0);
    EM_WR(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00000100)) | ((uint16_t)aenps << 8));
}

__INLINE uint8_t em_le_extab_rsvd_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x00000080)) >> 7);
}

__INLINE void em_le_extab_rsvd_setf(int elt_idx, uint8_t rsvd)
{
    BLE_ASSERT_ERR((((uint16_t)rsvd << 7) & ~((uint16_t)0x00000080)) == 0);
    EM_WR(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00000080)) | ((uint16_t)rsvd << 7));
}

