tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble_5_x_rw/ble_lib/ip/sch/import/ble_reg_em_et.h
__INLINE uint8_t em_le_extab_iso_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x00000040)) >> 6);
}

__INLINE void em_le_extab_iso_setf(int elt_idx, uint8_t iso)
{
    BLE_ASSERT_ERR((((uint16_t)iso << 6) & ~((uint16_t)0x00000040)) == 0);
    EM_WR(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00000040)) | ((uint16_t)iso << 6));
}

__INLINE uint8_t em_le_extab_status_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x00000038)) >> 3);
}

__INLINE void em_le_extab_status_setf(int elt_idx, uint8_t status)
{
    BLE_ASSERT_ERR((((uint16_t)status << 3) & ~((uint16_t)0x00000038)) == 0);
    EM_WR(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00000038)) | ((uint16_t)status << 3));
}

__INLINE uint8_t em_le_extab_mode_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x00000007)) >> 0);
}

__INLINE void em_le_extab_mode_setf(int elt_idx, uint8_t mode)
{
    BLE_ASSERT_ERR((((uint16_t)mode << 0) & ~((uint16_t)0x00000007)) == 0);
    EM_WR(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_LE_EXTAB_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00000007)) | ((uint16_t)mode << 0));
}

/**
 * @brief RAWSTP0 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  15:00              RAWSTP0   0x0
 * </pre>
 */
#define EM_RAWSTP0_ADDR   (0x00910002 + EM_ET_OFFSET)
#define EM_RAWSTP0_INDEX  0x00000001
#define EM_RAWSTP0_RESET  0x00000000

__INLINE uint16_t em_rawstp0_get(int elt_idx)
{
    return EM_RD(EM_RAWSTP0_ADDR + elt_idx * REG_EM_ET_SIZE);
}

__INLINE void em_rawstp0_set(int elt_idx, uint16_t value)
{
    EM_WR(EM_RAWSTP0_ADDR + elt_idx * REG_EM_ET_SIZE, value);
}

// field definitions
#define EM_RAWSTP0_MASK   ((uint16_t)0x0000FFFF)
#define EM_RAWSTP0_LSB    0
#define EM_RAWSTP0_WIDTH  ((uint16_t)0x00000010)

#define EM_RAWSTP0_RST    0x0

__INLINE uint16_t em_rawstp0_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_RAWSTP0_ADDR + elt_idx * REG_EM_ET_SIZE);
    BLE_ASSERT_ERR((localVal & ~((uint16_t)0x0000FFFF)) == 0);
    return (localVal >> 0);
}

__INLINE void em_rawstp0_setf(int elt_idx, uint16_t rawstp0)
{
    BLE_ASSERT_ERR((((uint16_t)rawstp0 << 0) & ~((uint16_t)0x0000FFFF)) == 0);
    EM_WR(EM_RAWSTP0_ADDR + elt_idx * REG_EM_ET_SIZE, (uint16_t)rawstp0 << 0);
}

/**
 * @brief RAWSTP1 register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  11:00              RAWSTP1   0x0
 * </pre>
 */
#define EM_RAWSTP1_ADDR   (0x00910004 + EM_ET_OFFSET)
#define EM_RAWSTP1_INDEX  0x00000002
#define EM_RAWSTP1_RESET  0x00000000

__INLINE uint16_t em_rawstp1_get(int elt_idx)
{
    return EM_RD(EM_RAWSTP1_ADDR + elt_idx * REG_EM_ET_SIZE);
}

__INLINE void em_rawstp1_set(int elt_idx, uint16_t value)
{
    EM_WR(EM_RAWSTP1_ADDR + elt_idx * REG_EM_ET_SIZE, value);
}

// field definitions
#define EM_RAWSTP1_MASK   ((uint16_t)0x00000FFF)
#define EM_RAWSTP1_LSB    0
#define EM_RAWSTP1_WIDTH  ((uint16_t)0x0000000C)

#define EM_RAWSTP1_RST    0x0

__INLINE uint16_t em_rawstp1_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_RAWSTP1_ADDR + elt_idx * REG_EM_ET_SIZE);
    BLE_ASSERT_ERR((localVal & ~((uint16_t)0x00000FFF)) == 0);
    return (localVal >> 0);
}

__INLINE void em_rawstp1_setf(int elt_idx, uint16_t rawstp1)
{
    BLE_ASSERT_ERR((((uint16_t)rawstp1 << 0) & ~((uint16_t)0x00000FFF)) == 0);
    EM_WR(EM_RAWSTP1_ADDR + elt_idx * REG_EM_ET_SIZE, (uint16_t)rawstp1 << 0);
}

/**
 * @brief FINESTP register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  09:00              FINESTP   0x0
 * </pre>
 */
#define EM_FINESTP_ADDR   (0x00910006 + EM_ET_OFFSET)
#define EM_FINESTP_INDEX  0x00000003
#define EM_FINESTP_RESET  0x00000000

__INLINE uint16_t em_finestp_get(int elt_idx)
{
    return EM_RD(EM_FINESTP_ADDR + elt_idx * REG_EM_ET_SIZE);
}

__INLINE void em_finestp_set(int elt_idx, uint16_t value)
{
    EM_WR(EM_FINESTP_ADDR + elt_idx * REG_EM_ET_SIZE, value);
}

// field definitions
#define EM_FINESTP_MASK   ((uint16_t)0x000003FF)
#define EM_FINESTP_LSB    0
#define EM_FINESTP_WIDTH  ((uint16_t)0x0000000A)

#define EM_FINESTP_RST    0x0

__INLINE uint16_t em_finestp_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_FINESTP_ADDR + elt_idx * REG_EM_ET_SIZE);
    BLE_ASSERT_ERR((localVal & ~((uint16_t)0x000003FF)) == 0);
    return (localVal >> 0);
}

__INLINE void em_finestp_setf(int elt_idx, uint16_t finestp)
{
    BLE_ASSERT_ERR((((uint16_t)finestp << 0) & ~((uint16_t)0x000003FF)) == 0);
    EM_WR(EM_FINESTP_ADDR + elt_idx * REG_EM_ET_SIZE, (uint16_t)finestp << 0);
}

/**
 * @brief CSPTR register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  14:00                CSPTR   0x0
 * </pre>
 */
#define EM_CSPTR_ADDR   (0x00910008 + EM_ET_OFFSET)
#define EM_CSPTR_INDEX  0x00000004
#define EM_CSPTR_RESET  0x00000000

__INLINE uint16_t em_csptr_get(int elt_idx)
{
    return EM_RD(EM_CSPTR_ADDR + elt_idx * REG_EM_ET_SIZE);
}

__INLINE void em_csptr_set(int elt_idx, uint16_t value)
{
    EM_WR(EM_CSPTR_ADDR + elt_idx * REG_EM_ET_SIZE, value);
}

// field definitions
#define EM_CSPTR_MASK   ((uint16_t)0x00007FFF)
#define EM_CSPTR_LSB    0
#define EM_CSPTR_WIDTH  ((uint16_t)0x0000000F)

#define EM_CSPTR_RST    0x0

__INLINE uint16_t em_csptr_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_CSPTR_ADDR + elt_idx * REG_EM_ET_SIZE);
    BLE_ASSERT_ERR((localVal & ~((uint16_t)0x00007FFF)) == 0);
    return (localVal >> 0);
}

__INLINE void em_csptr_setf(int elt_idx, uint16_t csptr)
{
    BLE_ASSERT_ERR((((uint16_t)csptr << 0) & ~((uint16_t)0x00007FFF)) == 0);
    EM_WR(EM_CSPTR_ADDR + elt_idx * REG_EM_ET_SIZE, (uint16_t)csptr << 0);
}

/**
 * @brief PRIOBW register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     15          PRIOBW_UNIT   0
 *  14:00               PRIOBW   0x0
 * </pre>
 */
#define EM_PRIOBW_ADDR   (0x0091000A + EM_ET_OFFSET)
#define EM_PRIOBW_INDEX  0x00000005
#define EM_PRIOBW_RESET  0x00000000

__INLINE uint16_t em_priobw_get(int elt_idx)
{
    return EM_RD(EM_PRIOBW_ADDR + elt_idx * REG_EM_ET_SIZE);
}

__INLINE void em_priobw_set(int elt_idx, uint16_t value)
{
    EM_WR(EM_PRIOBW_ADDR + elt_idx * REG_EM_ET_SIZE, value);
}

