tuya/tuya-iotos-embeded-sdk-wifi-ble-bk7231n/platforms/bk7231n/bk7231n_os/beken378/driver/ble_5_x_rw/ble_lib/ip/sch/import/ble_reg_em_et.h
// field definitions
#define EM_PRIOBW_UNIT_BIT    ((uint16_t)0x00008000)
#define EM_PRIOBW_UNIT_POS    15
#define EM_PRIOBW_MASK        ((uint16_t)0x00007FFF)
#define EM_PRIOBW_LSB         0
#define EM_PRIOBW_WIDTH       ((uint16_t)0x0000000F)

#define EM_PRIOBW_UNIT_RST    0x0
#define EM_PRIOBW_RST         0x0

__INLINE void em_priobw_pack(int elt_idx, uint8_t priobwunit, uint16_t priobw)
{
    BLE_ASSERT_ERR((((uint16_t)priobwunit << 15) & ~((uint16_t)0x00008000)) == 0);
    BLE_ASSERT_ERR((((uint16_t)priobw << 0) & ~((uint16_t)0x00007FFF)) == 0);
    EM_WR(EM_PRIOBW_ADDR + elt_idx * REG_EM_ET_SIZE,  ((uint16_t)priobwunit << 15) | ((uint16_t)priobw << 0));
}

__INLINE void em_priobw_unpack(int elt_idx, uint8_t* priobwunit, uint16_t* priobw)
{
    uint16_t localVal = EM_RD(EM_PRIOBW_ADDR + elt_idx * REG_EM_ET_SIZE);

    *priobwunit = (localVal & ((uint16_t)0x00008000)) >> 15;
    *priobw = (localVal & ((uint16_t)0x00007FFF)) >> 0;
}

__INLINE uint8_t em_priobw_priobw_unit_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_PRIOBW_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x00008000)) >> 15);
}

__INLINE void em_priobw_priobw_unit_setf(int elt_idx, uint8_t priobwunit)
{
    BLE_ASSERT_ERR((((uint16_t)priobwunit << 15) & ~((uint16_t)0x00008000)) == 0);
    EM_WR(EM_PRIOBW_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_PRIOBW_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00008000)) | ((uint16_t)priobwunit << 15));
}

__INLINE uint16_t em_priobw_priobw_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_PRIOBW_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x00007FFF)) >> 0);
}

__INLINE void em_priobw_priobw_setf(int elt_idx, uint16_t priobw)
{
    BLE_ASSERT_ERR((((uint16_t)priobw << 0) & ~((uint16_t)0x00007FFF)) == 0);
    EM_WR(EM_PRIOBW_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_PRIOBW_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00007FFF)) | ((uint16_t)priobw << 0));
}

/**
 * @brief PRIOLVL register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  12:08            SCH_PRIO3   0x0
 *  04:00            SCH_PRIO2   0x0
 * </pre>
 */
#define EM_PRIOLVL_ADDR   (0x0091000C + EM_ET_OFFSET)
#define EM_PRIOLVL_INDEX  0x00000006
#define EM_PRIOLVL_RESET  0x00000000

__INLINE uint16_t em_priolvl_get(int elt_idx)
{
    return EM_RD(EM_PRIOLVL_ADDR + elt_idx * REG_EM_ET_SIZE);
}

__INLINE void em_priolvl_set(int elt_idx, uint16_t value)
{
    EM_WR(EM_PRIOLVL_ADDR + elt_idx * REG_EM_ET_SIZE, value);
}

// field definitions
#define EM_SCH_PRIO3_MASK   ((uint16_t)0x00001F00)
#define EM_SCH_PRIO3_LSB    8
#define EM_SCH_PRIO3_WIDTH  ((uint16_t)0x00000005)
#define EM_SCH_PRIO2_MASK   ((uint16_t)0x0000001F)
#define EM_SCH_PRIO2_LSB    0
#define EM_SCH_PRIO2_WIDTH  ((uint16_t)0x00000005)

#define EM_SCH_PRIO3_RST    0x0
#define EM_SCH_PRIO2_RST    0x0

__INLINE void em_priolvl_pack(int elt_idx, uint8_t schprio3, uint8_t schprio2)
{
    BLE_ASSERT_ERR((((uint16_t)schprio3 << 8) & ~((uint16_t)0x00001F00)) == 0);
    BLE_ASSERT_ERR((((uint16_t)schprio2 << 0) & ~((uint16_t)0x0000001F)) == 0);
    EM_WR(EM_PRIOLVL_ADDR + elt_idx * REG_EM_ET_SIZE,  ((uint16_t)schprio3 << 8) | ((uint16_t)schprio2 << 0));
}

__INLINE void em_priolvl_unpack(int elt_idx, uint8_t* schprio3, uint8_t* schprio2)
{
    uint16_t localVal = EM_RD(EM_PRIOLVL_ADDR + elt_idx * REG_EM_ET_SIZE);

    *schprio3 = (localVal & ((uint16_t)0x00001F00)) >> 8;
    *schprio2 = (localVal & ((uint16_t)0x0000001F)) >> 0;
}

__INLINE uint8_t em_priolvl_sch_prio3_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_PRIOLVL_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x00001F00)) >> 8);
}

__INLINE void em_priolvl_sch_prio3_setf(int elt_idx, uint8_t schprio3)
{
    BLE_ASSERT_ERR((((uint16_t)schprio3 << 8) & ~((uint16_t)0x00001F00)) == 0);
    EM_WR(EM_PRIOLVL_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_PRIOLVL_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00001F00)) | ((uint16_t)schprio3 << 8));
}

__INLINE uint8_t em_priolvl_sch_prio2_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_PRIOLVL_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x0000001F)) >> 0);
}

__INLINE void em_priolvl_sch_prio2_setf(int elt_idx, uint8_t schprio2)
{
    BLE_ASSERT_ERR((((uint16_t)schprio2 << 0) & ~((uint16_t)0x0000001F)) == 0);
    EM_WR(EM_PRIOLVL_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_PRIOLVL_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x0000001F)) | ((uint16_t)schprio2 << 0));
}

/**
 * @brief PTI_VXCHAN register definition
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  12:08             PTI_PRIO   0x0
 *  01:00               VXCHAN   0x0
 * </pre>
 */
#define EM_PTI_VXCHAN_ADDR   (0x0091000E + EM_ET_OFFSET)
#define EM_PTI_VXCHAN_INDEX  0x00000007
#define EM_PTI_VXCHAN_RESET  0x00000000

__INLINE uint16_t em_pti_vxchan_get(int elt_idx)
{
    return EM_RD(EM_PTI_VXCHAN_ADDR + elt_idx * REG_EM_ET_SIZE);
}

__INLINE void em_pti_vxchan_set(int elt_idx, uint16_t value)
{
    EM_WR(EM_PTI_VXCHAN_ADDR + elt_idx * REG_EM_ET_SIZE, value);
}

// field definitions
#define EM_PTI_PRIO_MASK   ((uint16_t)0x00001F00)
#define EM_PTI_PRIO_LSB    8
#define EM_PTI_PRIO_WIDTH  ((uint16_t)0x00000005)
#define EM_VXCHAN_MASK     ((uint16_t)0x00000003)
#define EM_VXCHAN_LSB      0
#define EM_VXCHAN_WIDTH    ((uint16_t)0x00000002)

#define EM_PTI_PRIO_RST    0x0
#define EM_VXCHAN_RST      0x0

__INLINE void em_pti_vxchan_pack(int elt_idx, uint8_t ptiprio, uint8_t vxchan)
{
    BLE_ASSERT_ERR((((uint16_t)ptiprio << 8) & ~((uint16_t)0x00001F00)) == 0);
    BLE_ASSERT_ERR((((uint16_t)vxchan << 0) & ~((uint16_t)0x00000003)) == 0);
    EM_WR(EM_PTI_VXCHAN_ADDR + elt_idx * REG_EM_ET_SIZE,  ((uint16_t)ptiprio << 8) | ((uint16_t)vxchan << 0));
}

__INLINE void em_pti_vxchan_unpack(int elt_idx, uint8_t* ptiprio, uint8_t* vxchan)
{
    uint16_t localVal = EM_RD(EM_PTI_VXCHAN_ADDR + elt_idx * REG_EM_ET_SIZE);

    *ptiprio = (localVal & ((uint16_t)0x00001F00)) >> 8;
    *vxchan = (localVal & ((uint16_t)0x00000003)) >> 0;
}

__INLINE uint8_t em_pti_vxchan_pti_prio_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_PTI_VXCHAN_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x00001F00)) >> 8);
}

__INLINE void em_pti_vxchan_pti_prio_setf(int elt_idx, uint8_t ptiprio)
{
    BLE_ASSERT_ERR((((uint16_t)ptiprio << 8) & ~((uint16_t)0x00001F00)) == 0);
    EM_WR(EM_PTI_VXCHAN_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_PTI_VXCHAN_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00001F00)) | ((uint16_t)ptiprio << 8));
}

__INLINE uint8_t em_pti_vxchan_vxchan_getf(int elt_idx)
{
    uint16_t localVal = EM_RD(EM_PTI_VXCHAN_ADDR + elt_idx * REG_EM_ET_SIZE);
    return ((localVal & ((uint16_t)0x00000003)) >> 0);
}

__INLINE void em_pti_vxchan_vxchan_setf(int elt_idx, uint8_t vxchan)
{
    BLE_ASSERT_ERR((((uint16_t)vxchan << 0) & ~((uint16_t)0x00000003)) == 0);
    EM_WR(EM_PTI_VXCHAN_ADDR + elt_idx * REG_EM_ET_SIZE, (EM_RD(EM_PTI_VXCHAN_ADDR + elt_idx * REG_EM_ET_SIZE) & ~((uint16_t)0x00000003)) | ((uint16_t)vxchan << 0));
}


#endif // _REG_EM_ET_H_

